In [1]:
import pandas as pd

In [2]:
pd.__version__

'0.25.1'

In [3]:
my_obj = pd.Series([4, 7, -5, 3])

In [5]:
my_obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
my_obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
my_obj

0    4
1    7
2   -5
3    3
dtype: int64

In [9]:
data = {'name': ['Bob', 'Nancy','Amy','Elsa','Jack'],
        'year': [1996, 1997, 1997, 1996, 1997],
        'month': [8, 8, 7, 1, 12],
        'day':[11,23,8,3,11]}
myframe = pd.DataFrame(data)
myframe

    name  year  month  day
0    Bob  1996      8   11
1  Nancy  1997      8   23
2    Amy  1997      7    8
3   Elsa  1996      1    3
4   Jack  1997     12   11

In [10]:
df = pd.read_csv('./test.csv')

In [11]:
df

  h1 h2 h3
0  a  b  c
1  1  2  3

In [16]:
df.head(-1)

  h1 h2 h3
0  a  b  c

In [15]:
df.tail(-1)

  h1 h2 h3
1  1  2  3

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
h1    2 non-null object
h2    2 non-null object
h3    2 non-null object
dtypes: object(3)
memory usage: 176.0+ bytes

In [18]:
df.shape

(2, 3)

In [21]:
df

  h1 h2 h3
0  a  b  c
1  1  2  3

In [27]:
df[['h1','h3']]

  h1 h3
0  a  c
1  1  3

In [28]:
df['h1'][0:2]

0    a
1    1
Name: h1, dtype: object

In [30]:
df.insert(2,column="h2.1",value='b.1')

In [31]:
df

  h1 h2 h2.1 h3
0  a  b  b.1  c
1  1  2  b.1  3

In [ ]:
df.insert(2,row=,value='b.1')